{
  "activation_dropout": 0,
  "activation_function": "gelu",
  "architectures": [
    "AutoformerForPrediction"
  ],
  "attention_dropout": 0.1,
  "autocorrelation_factor": 3,
  "cardinality": [
    0
  ],
  "context_length": 12,
  "d_model": 16,
  "decoder_attention_heads": 2,
  "decoder_ffn_dim": 8,
  "decoder_layerdrop": 0,
  "decoder_layers": 1,
  "distribution_output": "student_t",
  "dropout": 0,
  "embedding_dimension": [
    0
  ],
  "encoder_attention_heads": 2,
  "encoder_ffn_dim": 8,
  "encoder_layerdrop": 0,
  "encoder_layers": 1,
  "feature_size": 31,
  "init_std": 0.02,
  "input_size": 1,
  "is_encoder_decoder": true,
  "label_length": 10,
  "lags_sequence": [
    1,
    2,
    3,
    4,
    5,
    6,
    7
  ],
  "loss": "nll",
  "model_type": "autoformer",
  "moving_average": 15,
  "num_dynamic_real_features": 0,
  "num_parallel_samples": 1000,
  "num_static_categorical_features": 0,
  "num_static_real_features": 0,
  "num_time_features": 22,
  "prediction_length": 14,
  "scaling": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "use_cache": true
}
